# Clone Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolyLine..::..Clone Method
PolyLine Class See Also
---
Returns a copy of this polyline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PolyLine Clone()
```

Visual Basic
---
```text
Public Function Clone As PolyLine
```

Visual C++
---
```text
public:
PolyLine^ Clone()
```

# See Also
PolyLine Class
Autodesk.Revit.DB Namespace